html/nixos/practise/package.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>软件打包</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="config.html"> UP </a>
 |
 <a accesskey="H" href="practise.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">软件打包</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org04d61d7">准备工作</a>
<ul>
<li><a href="#orgf5fcb03">使用 NUR 的打包模版</a></li>
<li><a href="#org27c2df7">直接在 NixOS 配置文件中添加软件包</a></li>
</ul>
</li>
<li><a href="#org02d28c3">打包流程</a></li>
<li><a href="#org56aa648">实例</a>
<ul>
<li><a href="#org4b0c030">开源</a>
<ul>
<li><a href="#org1d0e967">简单：LibOQS（C++，CMake，自动化构建）</a></li>
<li><a href="#orge34ab51">中等：openssl-oqs-provider（C，增加依赖）</a></li>
<li><a href="#orgd44c35f">困难：OSDLyrics（Python 和 C++，两轮构建）</a></li>
</ul>
</li>
<li><a href="#org1ba171c">闭源</a></li>
<li><a href="#org7826fcf">特殊</a></li>
</ul>
</li>
<li><a href="#orgd207e78">总结</a></li>
</ul>
</div>
</div>
<p>
NixOS 的一大特点是，系统所有的二进制程序和库文件都在 /nix/store 目录中，由 Nix 包管理器管理
</p>

<pre class="example" id="org99d929e">
这也意味着，NixOS 不符合 Linux 的 FHS 标准

它的 /lib 或 /lib64 目录下不存在类似 ld-linux-x86-64.so.2 之类的库文件动态加载器，更不存在 libc.so 之类的库文件

因此，除非静态链接，否则为其它 Linux 下编译的二进制文件将完全无法在 NixOS 下运行
</pre>

<p>
所以，要在 NixOS 上使用尚不存在于 Nixpkgs 仓库中的软件，最佳方案是自己用 Nix 语言写一份打包脚本，给这个软件打一个包，然后把打包定义加入 configuration.nix 中，从而安装到系统上
</p>

<p>
关于 NixOS 的软件打包，有三个好消息和两个坏消息。好消息是：
</p>
<ol class="org-ol">
<li><p>
Nixpkgs，也就是 NixOS 的软件仓库，提供了大量的打包自动化函数
</p>
<pre class="example" id="orgbad4712">
对于很多使用常见编程语言的开源软件（包括 C/C++，Python，Go，Node.js，Rust 等，但不包括 Java）

只需要调用现成的函数，指定一下源码的下载方式，Nixpkgs 就能自动检测软件的打包系统，自动传入合适的参数并完成软件打包
</pre></li>
<li>对于以二进制方式分发的软件（常见于闭源软件），Nixpkgs 也提供了现成的自动化解决方案：
<ul class="org-ul">
<li>一种是 Autopatchelf，自动修改二进制文件中的库文件路径，将其指向 /nix/store 中</li>
<li><p>
另一种是 Bubblewrap，或者基于 Bubblewrap 的 steam-run，模拟一个符合 FHS 标准的运行环境
</p>
<pre class="example" id="org31b994a">
顾名思义，steam-run 主要针对的是 Steam 游戏平台以及它上面的游戏，但它也可以用于其它闭源软件
</pre></li>
</ul></li>
<li><p>
Nix 包管理器会在一个隔离的环境中进行软件打包，可以粗略地理解成一个断网，限制权限，只允许访问固定路径的 Docker 容器。在编译过程中，访问外部路径或者联网的尝试全部会失败，只能使用 Nix 编译脚本中事先指定的依赖
</p>
<pre class="example" id="orgc73f6b0">
因此，打包出来的程序将完全不依赖其它文件
</pre></li>
</ol>

<p>
坏消息是：
</p>
<ol class="org-ol">
<li><p>
开发者不一定比打包者更懂 Linux
</p>
<pre class="example" id="org054d414">
开发者可能会在代码和编译脚本里写死各种路径，做出各种只符合 FHS 标准的假设

此时就需要你手动写补丁，纠正这些路径，让程序可以在 NixOS 上正常编译运行
</pre></li>
<li><p>
一旦遇到了不能使用现成函数的情况，包括下列情况，就得做好 “一杯茶，一包烟，一个 Bug 调一天“ 的准备：
</p>
<ul class="org-ul">
<li><p>
开发者使用了一些奇怪的源码目录结构，或者非标准的编译方式
</p>
<pre class="example" id="orgce1ae07">
例如 osdlyrics
</pre></li>
<li><p>
程序主动检测运行环境
</p>
<pre class="example" id="org25fc493">
例如 UOS 版微信客户端
</pre></li>
<li><p>
程序主动检测对它本身的修改
</p>
<pre class="example" id="org2139b2c">
例如 SVP 视频补帧软件
</pre></li>
</ul>

<pre class="example" id="org43bf86c">
我在几个月前将日常使用的发行版从 Arch Linux 换成了 NixOS，在使用过程中打了很多 NixOS 软件包

本文将从简单的打包开始一步步推进，介绍 NixOS 打包的方法，遇到的常见问题以及应对策略
</pre></li>
</ol>
<div id="outline-container-org04d61d7" class="outline-2">
<h2 id="org04d61d7">准备工作</h2>
<div class="outline-text-2" id="text-org04d61d7">
<p>
首先，强烈建议安装好 NixOS 操作系统，并在 NixOS 上进行打包
</p>
<ul class="org-ul">
<li><p>
虽然在非 NixOS 的操作系统上也可以用 Nix 包管理器打包软件，但打包出的软件在运行过程中可能还会残留有对 FHS 标准目录的依赖，从而导致它们无法正常在 NixOS 上使用
</p>
<pre class="example" id="orga8cb487">
当然，如果你打包只是自用，只考虑自己的运行环境，那可以忽略这条
</pre></li>
<li><p>
此外，要在非 NixOS 的操作系统上安装 Nix 打包的软件，需要使用 Home Manager，一个通过 Nix 语言的配置文件来管理你的 Home 目录下的软件配置文件的工具
</p>
<pre class="example" id="orgabbb6b0">
这需要自行研究，或者查阅其它人的相关文章
</pre></li>
</ul>
</div>
<div id="outline-container-orgf5fcb03" class="outline-3">
<h3 id="orgf5fcb03">使用 NUR 的打包模版</h3>
<div class="outline-text-3" id="text-orgf5fcb03">
<p>
<span class="underline">NUR</span> 是 Nix 的由 <b>用户自行管理</b> 的 <span class="underline">软件仓库</span>
</p>

<pre class="example" id="org8bb22cd">
这类似于 Arch Linux 的 AUR

NUR 提供了一份现成的 Nix 仓库模版，你可以方便地统一添加、管理自己的软件包
</pre>

<p>
在 GitHub 上，访问 <a href="https://github.com/nix-community/nur-packages-template">nur-packages-template</a>，点击 <span class="underline">Use this template</span> 用这个模版建立一个仓库。之后，可以将所有软件包统一保存在你新建的仓库。如果要将自己的软件包发布到 NUR，需要向 NUR 的主仓库发起 Pull Request，将自己的仓库地址加进去
</p>

<pre class="example" id="org7d745d0">
但即使不发 Pull Request，也完全可以直接使用自己的仓库
</pre>

<p>
然后，把你的仓库 Clone 下来
</p>
<ul class="org-ul">
<li><p>
对于不使用 Nix Flake 的用户，运行以下命令可以对 example-package 这个模版自带的示例软件包进行打包：
</p>
<div class="org-src-container">
<pre class="src src-sh">nix-build -A example-package
</pre>
</div></li>
<li><p>
对于使用 Flake 的用户，运行以下命令：
</p>
<div class="org-src-container">
<pre class="src src-sh">nix flake update <span style="color: #ff4500;"># </span><span style="color: #ff4500;">&#21487;&#36873;&#65292;&#23558; flake.lock &#20013;&#30340; Nixpkgs &#31561;&#20179;&#24211;&#26356;&#26032;&#21040;&#26368;&#26032;&#29256;</span>
nix build <span style="color: #ffa07a;">".#example-package"</span>
</pre>
</div></li>
</ul>

<p>
接着，在你的 NixOS 配置中添加自己的仓库：
</p>
<ul class="org-ul">
<li><p>
对于不使用 Nix Flake 的用户，在 <span class="underline">configuration.nix</span> 中添加如下定义：
</p>
<div class="org-src-container">
<pre class="src src-nix"><span style="color: #eedd82;">nixpkgs.config.packageOverrides</span> = pkgs: {
  <span style="color: #eedd82;">myRepo</span> = <span style="color: #b0c4de;">import</span> (builtins.fetchTarball <span style="color: #ffa07a;">"https://github.com/nix-community/nur-packages-template/archive/master.tar.gz"</span>) {
    <span style="color: #00ffff;">inherit</span> pkgs;
  };
};
</pre>
</div>
<pre class="example" id="org1af07d7">
将 https://github.com/nix-community/nur-packages-template 替换成你的仓库地址

这样操作后，你就能用类似于 pkgs.myRepo.example-package 的方式使用你打的包了
</pre></li>
<li>对于使用 Nix Flake 的用户：
<ol class="org-ol">
<li><p>
在 <span class="underline">flake.nix</span> 中的 <span class="underline">inputs</span> 一节中添加如下定义：
</p>
<div class="org-src-container">
<pre class="src src-nix"><span style="color: #eedd82;">inputs</span> = {
  <span style="color: #ff4500;"># ...</span>
  <span style="color: #eedd82;">myRepo</span> = {
    <span style="color: #eedd82;">url</span> = <span style="color: #ffa07a;">"github:nix-community/nur-packages-template"</span>;
    <span style="color: #eedd82;">inputs.nixpkgs.follows</span> = <span style="color: #ffa07a;">"nixpkgs"</span>;
  };
  <span style="color: #ff4500;"># ...</span>
};
</pre>
</div>
<pre class="example" id="orgbda6df8">
将 nix-community/nur-packages-template 替换成你的仓库地址
</pre></li>
<li><p>
在 <span class="underline">inputs</span> 的 <span class="underline">nixosConfigurations</span> 定义中，为每个系统添加一个 module：
</p>
<div class="org-src-container">
<pre class="src src-nix"><span style="color: #eedd82;">outputs</span> = { self, nixpkgs, ... }@inputs: {
  nixosConfigurations.<span style="color: #ffa07a;">"nixos"</span> = nixpkgs.lib.nixosSystem {
    <span style="color: #eedd82;">system</span> = <span style="color: #ffa07a;">"x86_64-linux"</span>;
    <span style="color: #eedd82;">modules</span> = [
      <span style="color: #ff4500;"># &#22312; modules &#30340;&#24320;&#22836;&#28155;&#21152;&#19979;&#38754;&#36825;&#20960;&#34892;</span>
      ({
              <span style="color: #eedd82;">nixpkgs.overlays</span> = [
                      (final: prev: {
                        <span style="color: #eedd82;">myRepo</span> = inputs.myRepo.packages.<span style="color: #ffa07a;">"</span><span style="color: #7fffd4;">${</span>prev.system<span style="color: #7fffd4;">}</span>";
                      })
              ];
      })
      <span style="color: #ff4500;"># &#22312; modules &#30340;&#24320;&#22836;&#28155;&#21152;&#19978;&#38754;&#36825;&#20960;&#34892;</span>

      <span style="color: #7fffd4;">./configuration.nix</span>
    ];
  };
};
</pre>
</div></li>
</ol></li>
</ul>

<p>
这样操作后，就能用类似于 pkgs.myRepo.example-package 的方式使用你打的包了
</p>
</div>
</div>
