html/nixos/practise/package.html
<div id="outline-container-org27c2df7" class="outline-3">
<h3 id="org27c2df7">直接在 NixOS 配置文件中添加软件包</h3>
<div class="outline-text-3" id="text-org27c2df7">
<pre class="example" id="orgbe2e4b3">
当然，也可以不使用 NUR 的模版，而是直接把打包定义和 NixOS 的配置文件放在一起
</pre>

<p>
假设有这样一个打包定义，保存成 <span class="underline">example-package.nix</span> ：（来自 <a href="https://github.com/nix-community/nur-packages-template/blob/master/pkgs/example-package/default.nix">default.nix</a>）
</p>

<div class="org-src-container">
<pre class="src src-nix">{ stdenv }:

stdenv.mkDerivation <span style="color: #00ffff;">rec</span> {
  <span style="color: #eedd82;">name</span> = <span style="color: #ffa07a;">"example-package-</span><span style="color: #7fffd4;">${</span>version<span style="color: #7fffd4;">}</span>";
  <span style="color: #eedd82;">version</span> = <span style="color: #ffa07a;">"1.0"</span>;
  <span style="color: #eedd82;">src</span> = <span style="color: #7fffd4;">./.</span>;
  <span style="color: #eedd82;">buildPhase</span> = <span style="color: #ffa07a;">"echo echo Hello World &gt; example"</span>;
  <span style="color: #eedd82;">installPhase</span> = <span style="color: #ffa07a;">"install -Dm755 example $out"</span>;
}
</pre>
</div>

<p>
现在可以在 <span class="underline">configuration.nix</span> 中使用 <span class="underline">pkgs.callPackage</span> 函数来调用它：
</p>

<div class="org-src-container">
<pre class="src src-nix">{ config, pkgs, ... }:

{
  <span style="color: #ff4500;"># &#30452;&#25509;&#20351;&#29992;&#36825;&#20010;&#21253;</span>
  <span style="color: #eedd82;">environment.systemPackages</span> = [
    (pkgs.callPackage <span style="color: #7fffd4;">./example-package.nix</span> { })
  ];

  <span style="color: #ff4500;"># &#25110;&#32773;&#23558;&#36825;&#20010;&#21253;&#20808;&#23450;&#20041;&#25104;&#19968;&#20010;&#24120;&#37327;</span>
  <span style="color: #eedd82;">environment.systemPackages</span> = <span style="color: #00ffff;">let</span>
    <span style="color: #eedd82;">examplePackage</span> = pkgs.callPackage <span style="color: #7fffd4;">./example-package.nix</span> { };
  <span style="color: #00ffff;">in</span> [
    examplePackage
  ];
}
</pre>
</div>

<p>
如果要单独尝试构建这个软件包，可以使用以下命令：
</p>

<div class="org-src-container">
<pre class="src src-sh">nix-build -E <span style="color: #ffa07a;">'with import &lt;nixpkgs&gt; {}; callPackage ./example-package.nix {}'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org02d28c3" class="outline-2">
<h2 id="org02d28c3">打包流程</h2>
<div class="outline-text-2" id="text-org02d28c3">
<p>
虽然可以直接调用 Nix 包管理器内置的 <span class="underline">builtins.derivation</span> 函数进行打包，但一般用更为方便的 <span class="underline">stdenv.mkDerivation</span> 函数来生成一个 Nix 包管理器的打包定义。相比于 builtins.derivation，stdenv.mkDerivation 将打包过程分成了 7 个 <b>步骤</b> <span class="underline">Phase</span> ：
</p>
<ol class="org-ol">
<li>解压 <span class="underline">Unpack</span> phase：
<ul class="org-ul">
<li><p>
在这一步中，stdenv.mkDerivation 会自动解压 <span class="underline">src</span> 参数指定的 <b>源码包</b>
</p>
<pre class="example" id="org73777f9">
例如 如果源码包是 .tar.gz 格式的，就会自动调用 tar xf
</pre></li>
<li><p>
但 stdenv.mkDerivation 不能识别所有压缩格式，例如 .zip 就不行，需要手动指定解压命令：
</p>
<div class="org-src-container">
<pre class="src src-nix"><span style="color: #eedd82;">nativeBuildInputs</span> = [ unzip ];
<span style="color: #eedd82;">unpackPhase</span> = <span style="color: #ffa07a;">''</span>
<span style="color: #ffa07a;">  unzip $src</span>
<span style="color: #ffa07a;">''</span>;
</pre>
</div></li>
<li>stdenv.mkDerivation 要求 <span class="underline">源码包的顶层</span> 是一个 <span class="underline">文件夹</span> ，解压完成后会自动 <span class="underline">cd</span> 进去</li>
</ul></li>
<li>打补丁 <span class="underline">patch</span> phase:
<ul class="org-ul">
<li><p>
在这一步中，stdenv.mkDerivation 会按顺序应用 <span class="underline">patches</span> 列表中的 <b>所有补丁</b>
</p>
<pre class="example" id="org9aaa780">
这一步可以用来解决一部分软件和 NixOS 的不兼容问题
</pre></li>
</ul></li>
<li>配置 <span class="underline">configure</span> phase:
<ul class="org-ul">
<li><p>
这一步相当于运行 <span class="underline">./configure</span> 或者 <span class="underline">cmake</span>
</p>
<pre class="example" id="orgace3712">
stdenv.mkDerivation 会自动检测打包方案并调用相应命令，或者当相应配置文件不存在时，自动跳过这一步
</pre>
<ul class="org-ul">
<li>注意：要调用 cmake，需要额外加一行 <span class="underline">nativeBuildInputs = [ cmake ];</span>  把 CMake 加入打包环境中</li>
<li>可以用 <span class="underline">configureFlags</span> 或者 <span class="underline">cmakeFlags</span> 添加配置参数，例如启用/禁用软件的功能。</li>
</ul></li>
</ul></li>
<li>编译 <span class="underline">build</span> phase:
<ul class="org-ul">
<li>这一步相当于运行 <span class="underline">make</span> 。可以用 <span class="underline">makeFlags</span> 添加传给 make 的参数</li>
</ul></li>
<li>测试 <span class="underline">test</span> phase:
<ul class="org-ul">
<li>这一步会运行源码中自带的测试用例，以保证软件功能正确</li>
<li>可以用 <span class="underline">doCheck = false;</span> 禁用这一步</li>
</ul></li>
<li>安装 <span class="underline">install</span> phase:
<ul class="org-ul">
<li>这一步相当于运行 <span class="underline">make install</span> ，将编译结果复制到 Nix store 的相应文件夹中
<ul class="org-ul">
<li>整个构建过程是在临时文件夹中，而不是 Nix store 中进行的，因此需要这一步将文件复制过去</li>
<li>当手动指定安装命令时，*目标路径* 存在变量 <span class="underline">$out</span> 中。$out 可以是存放有文件的文件夹，也可以直接是一个文件</li>
</ul></li>
</ul></li>
<li>额外修补 <span class="underline">fixup</span> phase:
<ul class="org-ul">
<li><p>
这一步会对 Nix store 中的结果做一些清理
</p>
<pre class="example" id="org975bbb1">
例如去除调试符号等
Autopatchelf Hook，一个自动替换闭源软件 .so 的路径的 Hook，就是在这一步运行的
</pre></li>
<li>可以用 <span class="underline">dontFixup = true;</span> 禁用这一步</li>
</ul></li>
</ol>

<p>
每一个步骤都可以手动指定对应的命令，或者在原有命令之前或之后额外增加命令。以安装这一步为例：
</p>
<div class="org-src-container">
<pre class="src src-nix"><span style="color: #eedd82;">preInstall</span> = <span style="color: #ffa07a;">''</span>
<span style="color: #ffa07a;">  echo &#36825;&#37324;&#25351;&#23450;&#22312;&#23433;&#35013;&#27493;&#39588;&#20043;&#21069;&#36816;&#34892;&#30340;&#21629;&#20196;</span>
<span style="color: #ffa07a;">''</span>;
<span style="color: #eedd82;">installPhase</span> = <span style="color: #ffa07a;">''</span>
<span style="color: #ffa07a;">  # &#36816;&#34892; preInstall &#30340;&#21629;&#20196;&#12290;&#40664;&#35748;&#30340; installPhase &#33258;&#24102;&#20102;&#19979;&#38754;&#36825;&#19968;&#34892;&#65292;&#20294;&#24403;&#20320;&#25351;&#23450;&#25972;&#20010;&#27493;&#39588;&#30340;&#21629;&#20196;&#26102;&#65292;&#23601;&#38656;&#35201;&#33258;&#24049;&#21152;&#19978;&#65292;&#21542;&#21017; preInstall &#19981;&#20250;&#36816;&#34892;</span>
<span style="color: #ffa07a;">  runHook preInstall</span>

<span style="color: #ffa07a;">  echo &#36825;&#37324;&#25351;&#23450;&#23433;&#35013;&#27493;&#39588;&#30340;&#25152;&#26377;&#21629;&#20196;</span>

<span style="color: #ffa07a;">  # &#36816;&#34892; postInstall &#30340;&#21629;&#20196;&#65292;&#21516;&#29702;</span>
<span style="color: #ffa07a;">  runHook postInstall</span>
<span style="color: #ffa07a;">''</span>;
<span style="color: #eedd82;">postInstall</span> = <span style="color: #ffa07a;">''</span>
<span style="color: #ffa07a;">  echo &#36825;&#37324;&#25351;&#23450;&#22312;&#23433;&#35013;&#27493;&#39588;&#20043;&#21518;&#36816;&#34892;&#30340;&#21629;&#20196;</span>
<span style="color: #ffa07a;">''</span>;
</pre>
</div>

<pre class="example" id="org3f72652">
只看这些步骤的解释可能有些抽象，因此接下来我会给出一些实例，并给出详细解释

此外，实例中还会涉及 Nixpkgs 提供的对于几种常用编程语言的专用打包函数

例如 Python 的 buildPythonPackage，Go 的 buildGoModule 等等

这些实例都来自 NUR 软件源 https://github.com/xddxdd/nur-packages
</pre>
</div>
</div>
