src/nixos/practise/package.org
*** 简单：LibOQS（C++，CMake，自动化构建）
#+begin_example
  首先我们来看一个最简单的例子：LibOQS

  LibOQS 提供了多种后量子加密算法的实现，可以用来给 OpenSSL 或 BoringSSL 提供后量子加密支持
#+end_example

LibOQS 使用 CMake 构建，并且本身没有任何依赖，因此基本上所有工作都可以由 stdenv.mkDerivations 自动完成，只需要为 CMake 指定几个额外的参数：

#+begin_src nix 
  # 当你使用 pkgs.callPackage 函数时，这里的参数会用 Nixpkgs 的软件包和函数自动填充（如果有对应的话）
  { lib
  , stdenv
  , fetchFromGitHub
  , cmake
  , ...
  } @ args:

  stdenv.mkDerivation rec {
    # 指定包名和版本
    pname = "liboqs";
    version = "0.7.1";

    # 从 GitHub 下载源代码
    src = fetchFromGitHub ({
      owner = "open-quantum-safe";
      repo = "liboqs";
      # 对应的 commit 或者 tag，注意 fetchFromGitHub 不能跟随 branch！
      rev = "0.7.1";
      # 下载 git submodules，绝大部分软件包没有这个
      fetchSubmodules = false;
      # 这里的 SHA256 校验码不会算怎么办？先注释掉，然后构建这个软件包，Nix 会报错，并提示你正确的校验码
      sha256 = "sha256-m20M4+3zsH40hTpMJG9cyIjXp0xcCUBS+cCiRVLXFqM=";
    });

    # 并行编译，大幅加快打包速度，默认是启用的。对于极少数并行编译会失败的软件包，才需要禁用。
    enableParallelBuilding = true;
    # 如果基于 CMake 的软件包在打包时出现了奇怪的错误，可以尝试启用此选项
    # 此选项禁用了对 CMake 软件包的一些自动修正
    dontFixCmake = true;

    # 将 CMake 加入编译环境，用来生成 Makefile
    nativeBuildInputs = [ cmake ];

    # 传给 CMake 的配置参数，控制 liboqs 的功能
    cmakeFlags = [
      "-DBUILD_SHARED_LIBS=ON"
      "-DOQS_BUILD_ONLY_LIB=1"
      "-DOQS_USE_OPENSSL=OFF"
      "-DOQS_DIST_BUILD=ON"
    ];

    # stdenv.mkDerivation 自动帮你完成其余的步骤
  }
#+end_src

然后运行下面这行命令，Nix 包管理器就会自动构建这个软件包，并把输出链接到当前目录的 results

#+begin_src sh 
  nix-build -E 'with import <nixpkgs> {}; callPackage ./liboqs.nix {}'
#+end_src
*** 中等：openssl-oqs-provider（C，增加依赖）
#+begin_example
  有了 LibOQS，可以再打包一个 OpenSSL OQS Provider

  一个 OpenSSL 3.0 的加解密引擎，可以把后量子加密算法加入 OpenSSL 3.0 中
#+end_example

#+begin_src nix 
  { lib
  , stdenv
  , fetchFromGitHub
  , cmake
  , liboqs
  , openssl_3_0
  , python3
  , ...
  } @ args:

  stdenv.mkDerivation rec {
    pname = "openssl-oqs-provider";
    version = "ec60cde5cc894814016f821a1162fe1a4b888a75";
    src = fetchFromGitHub ({
      owner = "open-quantum-safe";
      repo = "oqs-provider";
      rev = "ec60cde5cc894814016f821a1162fe1a4b888a75";
      fetchSubmodules = false;
      sha256 = "sha256-NyT5CpQeclSJ0b4Qr4McAJXwKgy6SWiUijkAgu6TTNM=";
    });

    enableParallelBuilding = true;
    dontFixCmake = true;

    # nativeBuildInputs 指定的是只有在构建时用到，运行时不会用到的软件包
    # 例如这里的用来生成 Makefile 的 CMake，和用来生成配置文件的 Python
    nativeBuildInputs = [
      cmake
      # 向打包环境加入 Python 和这几个包，preConfigure 中的命令需要用到
      (python3.withPackages (p: with p; [ jinja2 pyyaml tabulate ]))
    ];

    # buildInputs 指定的是运行时也会用到的软件包
    buildInputs = [
      liboqs
      openssl_3_0
    ];

    # 在配置步骤（Configure phase）之前运行的命令，用来启用所有的后量子加密算法
    preConfigure = ''
      cp ${sources.openssl-oqs.src}/oqs-template/generate.yml oqs-template/generate.yml
      sed -i "s/enable: false/enable: true/g" oqs-template/generate.yml
      LIBOQS_SRC_DIR=${sources.liboqs.src} python oqs-template/generate.py
    '';

    cmakeFlags = [ "-DCMAKE_BUILD_TYPE=Release" ];

    # 手动指定安装命令，把 oqsprovider.so 复制到 $out/lib 文件夹下
    # 一般来说可执行文件放在 $out/bin，库文件放在 $out/lib，菜单图标等放在 $out/share
    # 但并非强制，你在 $out 下随便放都可以，只不过在其它地方调用会麻烦一些
    installPhase = ''
      mkdir -p $out/lib
      install -m755 oqsprov/oqsprovider.so "$out/lib"
    '';
  }
#+end_src

这个包主要用来展示 _nativeBuildInputs_ 和 _buildInputs_ 的区别：
+ nativeBuildInputs 只有在 *构建* 时用到，一般用来生成一些配置文件或者编译脚本
  #+begin_example
    在交叉编译（给其它架构的设备编译软件）时，nativeBuildInputs 的架构会和运行编译的设备相同，而不是和目标设备相同

    例如用 x86 电脑给 ARM 树莓派编译时，nativeBuildInputs 的架构会是 x86
  #+end_example
+ buildInputs 在 *构建* 和 *最终运行* 软件时都会用到。所有的依赖库都会放到这里。这些依赖的架构和目标设备相同
  #+begin_example
    例如 openssl-oqs-provider 依赖的 liboqs 必然和它是同一架构的（都是 x86 或者都是 ARM）
  #+end_example
