html/nixos/practise/package.html
<div id="outline-container-org56aa648" class="outline-2">
<h2 id="org56aa648">实例</h2>
<div class="outline-text-2" id="text-org56aa648">
</div>
<div id="outline-container-org4b0c030" class="outline-3">
<h3 id="org4b0c030">开源</h3>
<div class="outline-text-3" id="text-org4b0c030">
</div>
<div id="outline-container-org1d0e967" class="outline-4">
<h4 id="org1d0e967">简单：LibOQS（C++，CMake，自动化构建）</h4>
<div class="outline-text-4" id="text-org1d0e967">
<pre class="example" id="org3845c31">
首先我们来看一个最简单的例子：LibOQS

LibOQS 提供了多种后量子加密算法的实现，可以用来给 OpenSSL 或 BoringSSL 提供后量子加密支持
</pre>

<p>
LibOQS 使用 CMake 构建，并且本身没有任何依赖，因此基本上所有工作都可以由 stdenv.mkDerivations 自动完成，只需要为 CMake 指定几个额外的参数：
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #ff4500;"># </span><span style="color: #ff4500;">&#24403;&#20320;&#20351;&#29992; pkgs.callPackage &#20989;&#25968;&#26102;&#65292;&#36825;&#37324;&#30340;&#21442;&#25968;&#20250;&#29992; Nixpkgs &#30340;&#36719;&#20214;&#21253;&#21644;&#20989;&#25968;&#33258;&#21160;&#22635;&#20805;&#65288;&#22914;&#26524;&#26377;&#23545;&#24212;&#30340;&#35805;&#65289;</span>
{ lib
, stdenv
, fetchFromGitHub
, cmake
, ...
} @ args:

stdenv.mkDerivation <span style="color: #00ffff;">rec</span> {
  <span style="color: #ff4500;"># &#25351;&#23450;&#21253;&#21517;&#21644;&#29256;&#26412;</span>
  <span style="color: #eedd82;">pname</span> = <span style="color: #ffa07a;">"liboqs"</span>;
  <span style="color: #eedd82;">version</span> = <span style="color: #ffa07a;">"0.7.1"</span>;

  <span style="color: #ff4500;"># &#20174; GitHub &#19979;&#36733;&#28304;&#20195;&#30721;</span>
  <span style="color: #eedd82;">src</span> = fetchFromGitHub ({
    <span style="color: #eedd82;">owner</span> = <span style="color: #ffa07a;">"open-quantum-safe"</span>;
    <span style="color: #eedd82;">repo</span> = <span style="color: #ffa07a;">"liboqs"</span>;
    <span style="color: #ff4500;"># &#23545;&#24212;&#30340; commit &#25110;&#32773; tag&#65292;&#27880;&#24847; fetchFromGitHub &#19981;&#33021;&#36319;&#38543; branch&#65281;</span>
    <span style="color: #eedd82;">rev</span> = <span style="color: #ffa07a;">"0.7.1"</span>;
    <span style="color: #ff4500;"># &#19979;&#36733; git submodules&#65292;&#32477;&#22823;&#37096;&#20998;&#36719;&#20214;&#21253;&#27809;&#26377;&#36825;&#20010;</span>
    <span style="color: #eedd82;">fetchSubmodules</span> = <span style="color: #b0c4de;">false</span>;
    <span style="color: #ff4500;"># &#36825;&#37324;&#30340; SHA256 &#26657;&#39564;&#30721;&#19981;&#20250;&#31639;&#24590;&#20040;&#21150;&#65311;&#20808;&#27880;&#37322;&#25481;&#65292;&#28982;&#21518;&#26500;&#24314;&#36825;&#20010;&#36719;&#20214;&#21253;&#65292;Nix &#20250;&#25253;&#38169;&#65292;&#24182;&#25552;&#31034;&#20320;&#27491;&#30830;&#30340;&#26657;&#39564;&#30721;</span>
    <span style="color: #eedd82;">sha256</span> = <span style="color: #ffa07a;">"sha256-m20M4+3zsH40hTpMJG9cyIjXp0xcCUBS+cCiRVLXFqM="</span>;
  });

  <span style="color: #ff4500;"># &#24182;&#34892;&#32534;&#35793;&#65292;&#22823;&#24133;&#21152;&#24555;&#25171;&#21253;&#36895;&#24230;&#65292;&#40664;&#35748;&#26159;&#21551;&#29992;&#30340;&#12290;&#23545;&#20110;&#26497;&#23569;&#25968;&#24182;&#34892;&#32534;&#35793;&#20250;&#22833;&#36133;&#30340;&#36719;&#20214;&#21253;&#65292;&#25165;&#38656;&#35201;&#31105;&#29992;&#12290;</span>
  <span style="color: #eedd82;">enableParallelBuilding</span> = <span style="color: #b0c4de;">true</span>;
  <span style="color: #ff4500;"># &#22914;&#26524;&#22522;&#20110; CMake &#30340;&#36719;&#20214;&#21253;&#22312;&#25171;&#21253;&#26102;&#20986;&#29616;&#20102;&#22855;&#24618;&#30340;&#38169;&#35823;&#65292;&#21487;&#20197;&#23581;&#35797;&#21551;&#29992;&#27492;&#36873;&#39033;</span>
  <span style="color: #ff4500;"># &#27492;&#36873;&#39033;&#31105;&#29992;&#20102;&#23545; CMake &#36719;&#20214;&#21253;&#30340;&#19968;&#20123;&#33258;&#21160;&#20462;&#27491;</span>
  <span style="color: #eedd82;">dontFixCmake</span> = <span style="color: #b0c4de;">true</span>;

  <span style="color: #ff4500;"># &#23558; CMake &#21152;&#20837;&#32534;&#35793;&#29615;&#22659;&#65292;&#29992;&#26469;&#29983;&#25104; Makefile</span>
  <span style="color: #eedd82;">nativeBuildInputs</span> = [ cmake ];

  <span style="color: #ff4500;"># &#20256;&#32473; CMake &#30340;&#37197;&#32622;&#21442;&#25968;&#65292;&#25511;&#21046; liboqs &#30340;&#21151;&#33021;</span>
  <span style="color: #eedd82;">cmakeFlags</span> = [
    <span style="color: #ffa07a;">"-DBUILD_SHARED_LIBS=ON"</span>
    <span style="color: #ffa07a;">"-DOQS_BUILD_ONLY_LIB=1"</span>
    <span style="color: #ffa07a;">"-DOQS_USE_OPENSSL=OFF"</span>
    <span style="color: #ffa07a;">"-DOQS_DIST_BUILD=ON"</span>
  ];

  <span style="color: #ff4500;"># stdenv.mkDerivation &#33258;&#21160;&#24110;&#20320;&#23436;&#25104;&#20854;&#20313;&#30340;&#27493;&#39588;</span>
}
</pre>
</div>

<p>
然后运行下面这行命令，Nix 包管理器就会自动构建这个软件包，并把输出链接到当前目录的 results
</p>

<div class="org-src-container">
<pre class="src src-sh">nix-build -E <span style="color: #ffa07a;">'with import &lt;nixpkgs&gt; {}; callPackage ./liboqs.nix {}'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge34ab51" class="outline-4">
<h4 id="orge34ab51">中等：openssl-oqs-provider（C，增加依赖）</h4>
<div class="outline-text-4" id="text-orge34ab51">
<pre class="example" id="org4e5b147">
有了 LibOQS，可以再打包一个 OpenSSL OQS Provider

一个 OpenSSL 3.0 的加解密引擎，可以把后量子加密算法加入 OpenSSL 3.0 中
</pre>

<div class="org-src-container">
<pre class="src src-nix">{ lib
, stdenv
, fetchFromGitHub
, cmake
, liboqs
, openssl_3_0
, python3
, ...
} @ args:

stdenv.mkDerivation <span style="color: #00ffff;">rec</span> {
  <span style="color: #eedd82;">pname</span> = <span style="color: #ffa07a;">"openssl-oqs-provider"</span>;
  <span style="color: #eedd82;">version</span> = <span style="color: #ffa07a;">"ec60cde5cc894814016f821a1162fe1a4b888a75"</span>;
  <span style="color: #eedd82;">src</span> = fetchFromGitHub ({
    <span style="color: #eedd82;">owner</span> = <span style="color: #ffa07a;">"open-quantum-safe"</span>;
    <span style="color: #eedd82;">repo</span> = <span style="color: #ffa07a;">"oqs-provider"</span>;
    <span style="color: #eedd82;">rev</span> = <span style="color: #ffa07a;">"ec60cde5cc894814016f821a1162fe1a4b888a75"</span>;
    <span style="color: #eedd82;">fetchSubmodules</span> = <span style="color: #b0c4de;">false</span>;
    <span style="color: #eedd82;">sha256</span> = <span style="color: #ffa07a;">"sha256-NyT5CpQeclSJ0b4Qr4McAJXwKgy6SWiUijkAgu6TTNM="</span>;
  });

  <span style="color: #eedd82;">enableParallelBuilding</span> = <span style="color: #b0c4de;">true</span>;
  <span style="color: #eedd82;">dontFixCmake</span> = <span style="color: #b0c4de;">true</span>;

  <span style="color: #ff4500;"># nativeBuildInputs &#25351;&#23450;&#30340;&#26159;&#21482;&#26377;&#22312;&#26500;&#24314;&#26102;&#29992;&#21040;&#65292;&#36816;&#34892;&#26102;&#19981;&#20250;&#29992;&#21040;&#30340;&#36719;&#20214;&#21253;</span>
  <span style="color: #ff4500;"># &#20363;&#22914;&#36825;&#37324;&#30340;&#29992;&#26469;&#29983;&#25104; Makefile &#30340; CMake&#65292;&#21644;&#29992;&#26469;&#29983;&#25104;&#37197;&#32622;&#25991;&#20214;&#30340; Python</span>
  <span style="color: #eedd82;">nativeBuildInputs</span> = [
    cmake
    <span style="color: #ff4500;"># &#21521;&#25171;&#21253;&#29615;&#22659;&#21152;&#20837; Python &#21644;&#36825;&#20960;&#20010;&#21253;&#65292;preConfigure &#20013;&#30340;&#21629;&#20196;&#38656;&#35201;&#29992;&#21040;</span>
    (python3.withPackages (p: <span style="color: #00ffff;">with</span> p; [ jinja2 pyyaml tabulate ]))
  ];

  <span style="color: #ff4500;"># buildInputs &#25351;&#23450;&#30340;&#26159;&#36816;&#34892;&#26102;&#20063;&#20250;&#29992;&#21040;&#30340;&#36719;&#20214;&#21253;</span>
  <span style="color: #eedd82;">buildInputs</span> = [
    liboqs
    openssl_3_0
  ];

  <span style="color: #ff4500;"># &#22312;&#37197;&#32622;&#27493;&#39588;&#65288;Configure phase&#65289;&#20043;&#21069;&#36816;&#34892;&#30340;&#21629;&#20196;&#65292;&#29992;&#26469;&#21551;&#29992;&#25152;&#26377;&#30340;&#21518;&#37327;&#23376;&#21152;&#23494;&#31639;&#27861;</span>
  <span style="color: #eedd82;">preConfigure</span> = <span style="color: #ffa07a;">''</span>
<span style="color: #ffa07a;">    cp </span><span style="color: #7fffd4;">${</span>sources.openssl-oqs.src<span style="color: #7fffd4;">}</span><span style="color: #ffa07a;">/oqs-template/generate.yml oqs-template/generate.yml</span>
<span style="color: #ffa07a;">    sed -i "s/enable: false/enable: true/g" oqs-template/generate.yml</span>
<span style="color: #ffa07a;">    LIBOQS_SRC_DIR=</span><span style="color: #7fffd4;">${</span>sources.liboqs.src<span style="color: #7fffd4;">}</span><span style="color: #ffa07a;"> python oqs-template/generate.py</span>
<span style="color: #ffa07a;">  ''</span>;

  <span style="color: #eedd82;">cmakeFlags</span> = [ <span style="color: #ffa07a;">"-DCMAKE_BUILD_TYPE=Release"</span> ];

  <span style="color: #ff4500;"># &#25163;&#21160;&#25351;&#23450;&#23433;&#35013;&#21629;&#20196;&#65292;&#25226; oqsprovider.so &#22797;&#21046;&#21040; $out/lib &#25991;&#20214;&#22841;&#19979;</span>
  <span style="color: #ff4500;"># &#19968;&#33324;&#26469;&#35828;&#21487;&#25191;&#34892;&#25991;&#20214;&#25918;&#22312; $out/bin&#65292;&#24211;&#25991;&#20214;&#25918;&#22312; $out/lib&#65292;&#33756;&#21333;&#22270;&#26631;&#31561;&#25918;&#22312; $out/share</span>
  <span style="color: #ff4500;"># &#20294;&#24182;&#38750;&#24378;&#21046;&#65292;&#20320;&#22312; $out &#19979;&#38543;&#20415;&#25918;&#37117;&#21487;&#20197;&#65292;&#21482;&#19981;&#36807;&#22312;&#20854;&#23427;&#22320;&#26041;&#35843;&#29992;&#20250;&#40635;&#28902;&#19968;&#20123;</span>
  <span style="color: #eedd82;">installPhase</span> = <span style="color: #ffa07a;">''</span>
<span style="color: #ffa07a;">    mkdir -p $out/lib</span>
<span style="color: #ffa07a;">    install -m755 oqsprov/oqsprovider.so "$out/lib"</span>
<span style="color: #ffa07a;">  ''</span>;
}
</pre>
</div>

<p>
这个包主要用来展示 <span class="underline">nativeBuildInputs</span> 和 <span class="underline">buildInputs</span> 的区别：
</p>
<ul class="org-ul">
<li><p>
nativeBuildInputs 只有在 <b>构建</b> 时用到，一般用来生成一些配置文件或者编译脚本
</p>
<pre class="example" id="org41a284a">
在交叉编译（给其它架构的设备编译软件）时，nativeBuildInputs 的架构会和运行编译的设备相同，而不是和目标设备相同

例如用 x86 电脑给 ARM 树莓派编译时，nativeBuildInputs 的架构会是 x86
</pre></li>
<li><p>
buildInputs 在 <b>构建</b> 和 <b>最终运行</b> 软件时都会用到。所有的依赖库都会放到这里。这些依赖的架构和目标设备相同
</p>
<pre class="example" id="org516f42c">
例如 openssl-oqs-provider 依赖的 liboqs 必然和它是同一架构的（都是 x86 或者都是 ARM）
</pre></li>
</ul>
</div>
</div>
